In [1]:
import pandas as pd

In [6]:
columns=["Sepal.Length","Sepal.Width","Petal.Length","Petal.Width","Species"]
df=pd.read_csv("iris.data",names=columns)

In [7]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width      Species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [8]:
df.head(10)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width      Species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa
5           5.4          3.9           1.7          0.4  Iris-setosa
6           4.6          3.4           1.4          0.3  Iris-setosa
7           5.0          3.4           1.5          0.2  Iris-setosa
8           4.4          2.9           1.4          0.2  Iris-setosa
9           4.9          3.1           1.5          0.1  Iris-setosa

In [9]:
df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width         Species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [10]:
df.tail(10)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width         Species
140           6.7          3.1           5.6          2.4  Iris-virginica
141           6.9          3.1           5.1          2.3  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica
143           6.8          3.2           5.9          2.3  Iris-virginica
144           6.7          3.3           5.7          2.5  Iris-virginica
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [12]:
df.sample()

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width          Species
80           5.5          2.4           3.8          1.1  Iris-versicolor

In [14]:
df.sample(10)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width          Species
137           6.4          3.1           5.5          1.8   Iris-virginica
142           5.8          2.7           5.1          1.9   Iris-virginica
62            6.0          2.2           4.0          1.0  Iris-versicolor
3             4.6          3.1           1.5          0.2      Iris-setosa
79            5.7          2.6           3.5          1.0  Iris-versicolor
6             4.6          3.4           1.4          0.3      Iris-setosa
23            5.1          3.3           1.7          0.5      Iris-setosa
0             5.1          3.5           1.4          0.2      Iris-setosa
132           6.4          2.8           5.6          2.2   Iris-virginica
73            6.1          2.8           4.7          1.2  Iris-versicolor

In [15]:
df.shape

(150, 5)

In [16]:
df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [18]:
df.isnull().sum()

Sepal.Length    0
Sepal.Width     0
Petal.Length    0
Petal.Width     0
Species         0
dtype: int64

In [19]:
df.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [20]:
df.isnull()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [23]:
df.describe(include="all")

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width      Species
count     150.000000   150.000000    150.000000   150.000000          150
unique           NaN          NaN           NaN          NaN            3
top              NaN          NaN           NaN          NaN  Iris-setosa
freq             NaN          NaN           NaN          NaN           50
mean        5.843333     3.054000      3.758667     1.198667          NaN
std         0.828066     0.433594      1.764420     0.763161          NaN
min         4.300000     2.000000      1.000000     0.100000          NaN
25%         5.100000     2.800000      1.600000     0.300000          NaN
50%         5.800000     3.000000      4.350000     1.300000          NaN
75%         6.400000     3.300000      5.100000     1.800000          NaN
max         7.900000     4.400000      6.900000     2.500000          NaN

In [24]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [25]:
df.columns=["Sepal_length","Sepal_Width","Petal_Length","Petal_Width","Species_name"]

In [26]:
df

     Sepal_length  Sepal_Width  Petal_Length  Petal_Width    Species_name
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [29]:
df.Sepal_length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_length, Length: 150, dtype: float64

In [31]:
df[["Sepal_length","Sepal_Width"]]

     Sepal_length  Sepal_Width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [34]:
df=pd.DataFrame([["Name","Age","Sex"],["Latha","26","female"],["shruthi","34","female"]])

In [35]:
df

         0    1       2
0     Name  Age     Sex
1    Latha   26  female
2  shruthi   34  female

In [36]:
df=pd.DataFrame([["Latha","26","female"],["shruthi","34","female"]],columns=["Name","Age","Sex"])

In [37]:
df

      Name Age     Sex
0    Latha  26  female
1  shruthi  34  female

In [39]:
df.index=["name1","name2"]

In [40]:
df.index

Index(['name1', 'name2'], dtype='object')

In [43]:
df.rename(index={"name1":"name_1"},inplace=True)

In [44]:
df

           Name Age     Sex
name_1    Latha  26  female
name2   shruthi  34  female

In [47]:
df.rename(columns={"Name":"names"},inplace=True)

In [48]:
df

          names Age     Sex
name_1    Latha  26  female
name2   shruthi  34  female

In [49]:
scores={"math":[78,45,71],"english":[34,89,96],"env":[49,56,87]}

In [50]:
scores

{'math': [78, 45, 71], 'english': [34, 89, 96], 'env': [49, 56, 87]}

In [72]:
df=pd.DataFrame(scores,index=["name_1","name_2","name_3"])
df

        math  english  env
name_1    78       34   49
name_2    45       89   56
name_3    71       96   87

In [53]:
df1=df[:]

In [56]:
df1.drop("name_2",inplace=True)

C:\Users\chary\AppData\Local\Temp\ipykernel_11616\2769818231.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.drop("name_2",inplace=True)

In [57]:
df1

        math  english  env
name_1    78       34   49
name_3    71       96   87

In [58]:
df1.drop("english")

KeyError: "['english'] not found in axis"

In [59]:
df1

        math  english  env
name_1    78       34   49
name_3    71       96   87

In [63]:
df1.drop("english",axis=1)

        math  env
name_1    78   49
name_3    71   87

In [70]:
df

     math  english
env
49     78       34
56     45       89
87     71       96

In [67]:
df.loc[["name_3","name_1"]]

        math  english  env
name_3    71       96   87
name_1    78       34   49

In [68]:
df.set_index("env",inplace=True)

In [69]:
df

     math  english
env
49     78       34
56     45       89
87     71       96

In [71]:
df

     math  english
env
49     78       34
56     45       89
87     71       96

In [73]:
df

        math  english  env
name_1    78       34   49
name_2    45       89   56
name_3    71       96   87

In [74]:
df.iloc[0,1:]

english    34
env        49
Name: name_1, dtype: int64

In [76]:
df.iloc[1,2]

56

In [77]:
df.iloc[[0,1],[1,2]]

        english  env
name_1       34   49
name_2       89   56

In [78]:
df["lan"]=80

In [79]:
df

        math  english  env  lan
name_1    78       34   49   80
name_2    45       89   56   80
name_3    71       96   87   80

In [82]:
df.loc[3]=[10,34,56,21]

In [83]:
df

        math  english  env  lan
name_1    78       34   49   80
name_2    45       89   56   80
name_3    71       96   87   80
3         10       34   56   21